sportgym/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('admin', 'admin@admin.com', '$2y$13$aq3u168gIEcYgUMWKt1xLuJxl/fSTjkh.S4fZ6yU4JxkjqNzPWGWm', 'TGBRvabS4j9i8Hff5GyzfxUak5V22gaP', 'YlVy6piXmQTC3ta2ehgQi2PVPSZUZy_H_1575368849', 9, 1575368849, 1575368849)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        return $user->save() && $this->sendEmail($user);