sportgym/backend/controllers/DefinicoesController.php

    public function actionIndexGinasios()
    {
        $ginasios = Ginasio::find()->all();
---
SELECT * FROM `ginasio`