sportgym/backend/controllers/PerfilController.php

    public function actionView($id)
    {
        $model = $this->findModel($id);
        $modelUser = User::find()->where(['id' => $id])->one();
---
SELECT * FROM `user` WHERE `id`='2'

    public function actionUpdate($id)
    {
        // Guardar Perfil e User
        $modelPerfil = $this->findModel($id);
        $modelUser = User::findOne($id);
---
SELECT * FROM `user` WHERE `id`='2'