sportgym/backend/controllers/ProdutoController.php

    public function actionDelete($id)
    {
        $model = $this->findModel($id);

        $linhasVendas = LinhaVenda::find()->where(['IDproduto' => $model->IDproduto])->one();

        if($linhasVendas == null){
            $model->delete();
---
SELECT * FROM `linhavenda` WHERE `IDproduto`=2
DELETE FROM `produto` WHERE `IDproduto`=2