sportgym/backend/controllers/SiteController.php

    public function actionIndex()
    {
        $idPerfil = Yii::$app->user->getId(); //variavel para buscar o id de o perfil logado
        $nomeApresentacao = Perfil::findOne($idPerfil); // variavel para associar o perfil do utilizador logado
---
SELECT * FROM `perfil` WHERE `IDperfil`=1