sportgym/backend/controllers/VendaController.php

SELECT * FROM `venda` WHERE `IDvenda`='42'
SELECT * FROM `linhavenda` WHERE `IDvenda`='42'
SELECT * FROM `user` WHERE `id`=2
---
    public function actionView($id)
    {
        $comprador = User::findOne([Yii::$app->user->getId()]);
        $linhasVenda = LinhaVenda::find()->where(['IDvenda' => $id])->all();

        return $this->render('view', [
            'model' => $this->findModel($id),
            'comprador' => $comprador,
            'linhasVenda' => $linhasVenda,
        ]);