sportgym/frontend/controllers/LojaController.php

SELECT EXISTS(SELECT * FROM `perfil` WHERE `perfil`.`IDperfil`=2)
SELECT * FROM `venda` WHERE (`IDperfil`=2) AND (`estado`=0)
---
    public function actionIndex()
    {
        $venda = Venda::findOne(['IDperfil' => Yii::$app->user->getId(), 'estado' => 0]);

SELECT * FROM `venda` WHERE (`IDperfil`=1) AND (`estado`=0)
SELECT * FROM `produto` WHERE `IDproduto`='1'
---
    public function actionAdicionarCarrinho($IDproduto)
    {
        $venda = Venda::findOne(['IDperfil' => Yii::$app->user->getId(), 'estado' => 0]);
        $produto = Produto::findOne(['IDproduto' => $IDproduto]);

SELECT * FROM `produto` WHERE `IDproduto`='2'
---
    public function actionVerProduto($IDproduto)
    {
        $produto = Produto::find()->where(['IDproduto' => $IDproduto])->one();

SELECT * FROM `venda` WHERE (`IDperfil`=1) AND (`estado`=0)
SELECT * FROM `linhavenda` WHERE `IDvenda`=46
---
    public function actionCarrinho()
    {
        $user = Yii::$app->user->identity;
        $venda = Venda::find()->where(['IDperfil' => $user->getId()])->andWhere(['estado' => 0])->one();
        $linhaVendas = LinhaVenda::find()->where(['IDvenda' => $venda->IDvenda])->all();

SELECT * FROM `linhavenda` WHERE `IDlinhaVenda`='71'
SELECT * FROM `venda` WHERE (`IDperfil`=1) AND (`estado`=0)
SELECT COUNT(*) FROM `linhavenda` WHERE `IDvenda`=44
---
    public function actionMenosQuantidade($IDlinhaVenda)
    {
        $linhaVenda = LinhaVenda::findOne(['IDlinhaVenda' => $IDlinhaVenda]);
        $venda = Venda::findOne(['IDperfil' => Yii::$app->user->getId(), 'estado' => 0]);

        $linhaVenda->menosQuantidade();

        $outrasLinhas = LinhaVenda::find()->where(['IDvenda' => $venda->IDvenda]);
        if ($outrasLinhas->count() != 0) {

SELECT * FROM `linhavenda` WHERE `IDlinhaVenda`='68'
SELECT * FROM `venda` WHERE (`IDperfil`=2) AND (`estado`=0)
---
    public function actionMaisQuantidade($IDlinhaVenda)
    {
        $linhaVenda = LinhaVenda::findOne(['IDlinhaVenda' => $IDlinhaVenda]);
        $venda = Venda::findOne(['IDperfil' => Yii::$app->user->getId(), 'estado' => 0]);

SELECT * FROM `venda` WHERE (`IDperfil`=1) AND (`estado`=0)
SELECT * FROM `linhavenda` WHERE `IDvenda`=46
DELETE FROM `venda` WHERE `IDvenda`=46
---
    public function actionApagarVenda()
    {
        $venda = Venda::findOne(['IDperfil' => Yii::$app->user->getId(), 'estado' => 0]);
        $linhasVendas = LinhaVenda::find()->where(['IDvenda' => $venda->IDvenda])->all();

        foreach($linhasVendas as $linhaVenda)
        {
            $linhaVenda->delete();
        }
        $venda->delete();