sportgym/frontend/controllers/LojaController.php

    public function actionCarrinho()
    {
        $user = Yii::$app->user->identity;
        $venda = Venda::findOne(['IDperfil' => $user->id]);
---
SELECT * FROM `venda` WHERE `IDperfil`=1