sportgym/backend/views/perfil-aula/_form.php


    <?= $form->field($modelPerfilAula, 'nSocio')->textInput() ?>

    <?= $form->field($modelPerfilAula, 'IDaula')->dropDownList(
        ArrayHelper::map(Aula::find()->all(), 'IDaula', 'tipo'),
        [
            'prompt' => 'Selecione uma aula',
            'class' => 'form-control',
        ]
    ) ?>
---
SELECT * FROM `aula`