sportgym/backend/views/perfil-aula/index.php

SELECT * FROM `perfil` LIMIT 20
SELECT COUNT(*) FROM `perfil`
---
>>>>>>> GoncaloAula
    <?php echo $this->render('_search', ['model' => $perfilAula_searchModel]); ?>

    <?= GridView::widget([
        'dataProvider' => $perfilAula_dataProvider,
<<<<<<< HEAD
        // 'filterModel' => $perfilAula_searchModel,
        'columns' => [
            [
                'attribute' => 'Nº Socio',
                'value' => 'iDperfil.nSocio',
=======
        //'filterModel' => $perfilAula_searchModel,
        'columns' => [
            'IDperfil',
            [
                'label' => 'Nº Sócio',
                'attribute' => 'IDperfil',
                'value' => function ($model) {
                    $perfis = Perfil::find()->where(['IDperfil' => $model->IDperfil])->one();
                    return $perfis->nSocio;
                }
>>>>>>> GoncaloAula
            ],
