sportgym/common/models/LinhaVenda.php

UPDATE `linhavenda` SET `subTotal`=19.99 WHERE `IDlinhaVenda`=71
---
    public function atualizarLinhaVenda()
    {
        $produto = $this->iDproduto;
        $this->subTotal = $produto->precoProduto * $this->quantidade;
        $this->save();

INSERT INTO `linhavenda` (`IDvenda`, `IDproduto`, `quantidade`, `subTotal`) VALUES (45, 1, 1, 10)
---
    public function iniciarLinhaVenda($IDvenda, $produto)
    {
        $this->IDvenda = $IDvenda;
        $this->IDproduto = $produto->IDproduto;
        $this->quantidade = 1;
        $this->subTotal = $produto->precoProduto * $this->quantidade;
        $this->save();

UPDATE `linhavenda` SET `quantidade`=1 WHERE `IDlinhaVenda`=71
---
    public function menosQuantidade()
    {
        if ($this->quantidade > 1) {
            $this->quantidade--;
            $this->save();

UPDATE `linhavenda` SET `quantidade`=3 WHERE `IDlinhaVenda`=68
---
    public function maisQuantidade()
    {
        if ($this->quantidade >= 0 && $this->quantidade < 15) {
            $this->quantidade++;
            $this->save();