sportgym/common/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);
---
SELECT * FROM `user` WHERE `auth_key`='qAN7zHHhzcfnquV7v45NuS_-hk6PUgPA'