sportgym/common/models/Venda.php

SELECT SUM(subTotal) FROM `linhavenda` WHERE `IDvenda`=44
UPDATE `venda` SET `total`=19.989999771118 WHERE `IDvenda`=44
---
    public function atualizarVenda()
    {
        $this->total = LinhaVenda::find()->where(['IDvenda' => $this->IDvenda])->sum('subTotal');
        $this->save();

INSERT INTO `venda` (`estado`, `total`, `IDperfil`) VALUES (0, 0, 1)
---
    public function iniciarVenda()
    {
        $this->estado = 0;
        $this->total = 0;
        $this->IDperfil = Yii::$app->user->getId();
        $this->save();