sportgym/common/models/VendaSearch.php

SELECT * FROM `venda` ORDER BY `dataVenda` DESC
---
    public function search($params)
    {
        $query = Venda::find()->orderBy(['dataVenda' => SORT_DESC]);